[
    "<h2 style=\"box-sizing: border-box; font-family: inherit; font-weight: 500; line-height: 1.1; color: rgb(15, 101, 141); margin: 0px 0px 10px; font-size: 22px;\">Egypt&#39;s pyramid&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">restoration&nbsp;</span>– level 1</h2><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">Workers in Egypt are fixing a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">pyramid&nbsp;</span>called Menkaure. This pyramid is close to the&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">Sphinx&nbsp;</span>and the two large pyramids at Giza.</p><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">Workers want to put&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">granite&nbsp;</span>on top of the pyramid. It will look new. But some people are not happy about it. An expert, Monica Hanna, thinks that it is a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">silly&nbsp;</span>idea. It breaks all the&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">rules</span>&nbsp;for fixing old things. The workers say that it is a big gift for the world.</p><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">The plan is to finish the pyramid in three years. Many people in Egypt talk about taking care of old things, like buildings and special places. Egypt gets a lot of money from tourists. The country must think carefully about what to do with old buildings.</p><p><br/></p>",
    "Egypt’s pyramid restoration – level 2\nA video showing renovation work on Egypt’s Menkaure Pyramid made many people angry. Workers put a granite layer on top of a pyramid which is very close to the Sphinx and the larger Kharfe and Cheops pyramids at Giza.\n\nSome people call the project the project of the century which wants to bring back the pyramid’s original style. But other Egyptologists call the work absurd and against international renovation rules. The debate on the pyramids in Egypt is a big issue, especially because Egypt depends on tourism.\n\nRecently, there were fights over the destruction of historic areas in Cairo and changes to some historic buildings. This showed that most people didn’t agree with urban planning matters.\n\n​",
    "Egypt’s pyramid restoration – level 3\n​Renovation work on Egypt’s Menkaure Pyramid, which sits beside the Sphinx and the larger Khafre and Cheops pyramids at Giza, specifically the reinstallation of a granite layer, has sparked controversy.\n\nMostafa Waziri, the head of Egypt’s Supreme Council of Antiquities, shared a video of workers setting granite blocks on the pyramid’s base, deeming it ‘the project of the century’. Originally encased in granite, the pyramid lost part of its covering over time. The three-year restoration aims to recreate the pyramid’s original style. However, Egyptologist Monica Hanna criticized the project and called it absurd and a violation of international renovation principles.\n\nThe debate over heritage preservation in Egypt, a nation heavily reliant on tourism, continues to intensify, reflecting broader concerns about the management of historic sites and cultural heritage.\n\n",
    "<h2 style=\"box-sizing: border-box; font-family: inherit; font-weight: 500; line-height: 1.1; color: rgb(15, 101, 141); margin: 0px 0px 10px; font-size: 22px;\">A woman spends 14 hours on top of her car – level 1</h2><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">In northern California, a woman has a scary time. Her truck&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">overturns</span>&nbsp;in a big&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">creek</span>. It happens because it rains very much. She wants to cross the river. But there is too much water. The water is fast.</p><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">The woman spends the night on top of the truck.&nbsp; She gets&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">stuck</span>&nbsp;for almost 15 hours. Someone camping nearby sees her the next morning. They call for help.&nbsp; A special helicopter team comes to help. The helicopter lifts her from the truck. The woman goes to the hospital with small&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">injuries</span>.</p><p><br/></p>",
    "<h2 style=\"box-sizing: border-box; font-family: inherit; font-weight: 500; line-height: 1.1; color: rgb(15, 101, 141); margin: 0px 0px 10px; font-size: 22px;\">A woman spends 14 hours on top of her car – level 2</h2><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">In northern California, a woman faced a dangerous 15-hour situation after her&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">pickup</span>&nbsp;truck overturned in a river during heavy rain.</p><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">A helicopter team from the California Highway Patrol Air Operations started a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">daring</span>&nbsp;rescue. They lifted the woman from the rushing waters using a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">harness</span>. The woman wanted to cross Del Valle&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">Creek</span>, about 35 miles east of San Francisco, but she got stuck. She spent the night on top of her car, which probably saved her life. She survived with minor injuries.</p><p><br/></p>",
    "<h2 style=\"box-sizing: border-box; font-family: inherit; font-weight: 500; line-height: 1.1; color: rgb(15, 101, 141); margin: 0px 0px 10px; font-size: 22px;\">A woman spends 14 hours on top of her car – level 3</h2><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">A woman in northern California faced a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">harrowing</span>&nbsp;14-hour&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">ordeal&nbsp;</span>after her pickup truck overturned in a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">swollen</span>&nbsp;creek following heavy rain.</p><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">The California Highway Patrol Air Operations used a helicopter to rescue her from the rushing waters.&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">Dramatic</span>&nbsp;footage showed a&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">technician</span>&nbsp;using a harness to lift her from the vehicle to safety. Despite spending the night&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">atop</span>&nbsp;the overturned truck, she sustained only minor injuries. The rescue involved multiple emergency&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">agencies</span>, including the highway&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">patrol</span>&nbsp;and local fire department.</p><p style=\"box-sizing: border-box; margin-top: 0px; margin-bottom: 10px;\">Recent rainfall led to unexpected high water levels in the Del Valle creek, causing the woman’s&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">predicament</span>.&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">Remarkably</span>, her decision to climb on top of the car is&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">credited</span>&nbsp;with saving her life, and she was&nbsp;<span style=\"box-sizing: border-box; font-weight: 700;\">airlifted</span>&nbsp;to a hospital for treatment.</p><p><br/></p>"
]