<template>
  <div id="app">
    <!-- 头部---start -->
    <header>
      <div class="wrapper">
        <div class="logo pull-left">
          <a href="index.html"></a>
        </div>
        <div class="nav pull-left">
          <a href="index.html">首页</a>
          <a href="index.html#websiteAdvantage">解决方案</a>
          <a href="index.html#successCae">成功案例</a>
          <a href="pricing.html">定价</a>
          <a href="aboutus.html">关于我们</a>
        </div>
        <div class="loginRes pull-right">
          <headerInfo
            :isblack="true"
            :clearInfo="clearInfo"
            :userObject="$store.state.accountInfo"
            :showShopAndComList="showShopAndComList"
            v-if="$store.state.accountInfo.email && inited"
          ></headerInfo>
          <a
            v-if="!$store.state.accountInfo.email && inited"
            href="javascript:void(0);"
            class="login"
            @click="
              () => {
                $store.state.showsLogin = true;
              }
            "
            >登录</a
          >
          <a
            v-if="!$store.state.accountInfo.email && inited"
            href="javascript:void(0);"
            class="register"
            @click="
              () => {
                showRegister = true;
              }
            "
            >注册</a
          >
        </div>
      </div>
    </header>
    <!-- 头部---end -->

    <!-- 公司信息---start -->
    <div class="Info">
      <div class="wrap">
        <h6 id="aboutUs" style="margin-top: 50px; text-align: center">
          隐私政策
        </h6>
        <p><b> 发布日期：2022年8月1日 </b></p>
        <p><b> 生效日期：2022年8月1日 </b></p>
        <p><b> 版本号：V2.0 </b></p>
        <p>欢迎您使用平台！</p>
        <p>
          力盟傳媒集團有限公司及其关联公司（以下简称“力盟传媒”或“我们”）深知个人信息对您的重要性，因此我们非常重视保护您的隐私和个人信息。
        </p>
        <p>
          《隐私政策》（以下简称“本隐私政策”或“本政策”）适用于网站（以下简称“”或“本平台”），不适用于包含的或链接至第三方提供的信息与/或第三方服务（包括任何第三方应用、网站、产品、服务等），以及其他并非由我们向您提供的产品与/或服务内容。
        </p>
        <!-- <h5>二、收集来自商家的信息</h5> -->
        <p>
          我们希望通过本隐私政策向您说明在使用我们的产品/或服务时如何处理您的个人信息，以及我们为您提供的管理、保护这些信息的方式。<b
            >本隐私政策与您所使用的服务息息相关，希望您仔细阅读，在需要时，按照本隐私政策的指引，作出您认为适当的选择。</b
          >
        </p>
        <p>
          我们可能会不时更新本隐私政策，以反映我们的隐私惯例或其他运营，法律或监管原因的变更。如果我们对本隐私政策进行重大更改，我们将通过在本网站上发布修订后的政策以及在适当情况下通过其他方式向您发出此类更改通知。
        </p>
        <br />
        <p>本隐私政策将帮助您了解以下内容：</p>
        <p>一、我们如何收集您的个人信息</p>
        <p>二、我们如何使用您的个人信息</p>
        <p>三、我们如何委托处理、对外提供、转移、公开披露您的个人信息</p>
        <p>四、我们如何存储您的个人信息</p>
        <p>五、保护您个人信息的安全</p>
        <p>六、管理您的个人信息</p>
        <p>七、我们如何处理未成年人的信息</p>
        <p>八、本隐私政策如何更新</p>
        <p>九、联系我们</p>
        <br />
        <br />
        <h5>一、我们如何收集您的个人信息</h5>
        <p>
          <b>（一）账号注册与登录</b>
        </p>
        <p>
          当您注册账号时，我们会收集您的企业名称、地址、电子邮件地址、手机号码、<b>密码</b>、注册时间、注册来源，并收集向您发送的验证码信息。我们收集这些信息是为了帮助您创建商家账号。如您不提供这类信息，您将无法正常使用平台。
        </p>
        <p>
          您还可以配置您的员工账号，我们会收集您的相应员工姓名、邮箱、权限范围。
        </p>
        <p><b> （二）付费服务 </b></p>
        <p>
          当您订购平台的服务时，我们会收集您的<b>银行卡号</b>、发票抬头、发票邮寄地址、税号。我们收集这些信息是为了与您签订合同、完成交易、提供服务及为您开具发票。如您不提供这类信息，您将无法订购我们的服务，进行付费或开具发票。
        </p>
        <p><b> （三）服务内容展示 </b></p>
        <p>
          为了向您展示适应于您设备界面的产品并履行法定的网络日志留存义务，我们会收集有关您访问平台的方式和时间的数据，包括您使用的设备名称、类型和浏览器，网络连接，IP地址以及<b>浏览记录</b>。
        </p>
        <p><b> （四）客服服务 </b></p>
        <p>
          当您通过邮件或其他方式寻求客服支持时，为便于与您联系、尽快帮助您解决问题或记录相关问题的处理方案及结果、我们会收集您的姓名、电子邮件地址、账号信息、使用的设备和浏览器的信息、网络与IP地址、<b>沟通记录</b>以及您在沟通过程中提供给我们的其他个人信息。根据我们的服务条款，我们可能会要求您提供电子邮件地址以验证您的身份。
        </p>
        <p><b> （五）保障网络和服务安全稳定 </b></p>
        <p>
          为了保障网络和服务的安全、稳定运行，我们会收集您的IP地址、访问日期和时间，以解决网络和服务崩溃事件，防范身份盗用等安全风险。
        </p>
        <p><b> （六）来自Cookies和类似跟踪技术 </b></p>
        <p>
          什么是Cookie？Cookie是少量数据的集合，可能包含唯一标识符。Cookie会从网站发送到您的浏览器并存储在您的设备上。我们为访问我们网站的每台设备分配不同的Cookie。
        </p>
        <p>为什么使用Cookies和类似的跟踪技术？</p>
        <p>
          •
          我们使用cookies来识别您的设备，并在我们的网站上为您提供个性化体验。我们还使用cookies作为服务的一部分，例如为我们的商家商店运营购物车。
        </p>
        <p>
          • 我们使用Cookies来提供Google，Facebook，和其他第三方供应商的广告。
        </p>
        <p>
          •
          我们的第三方广告商使用cookies跟踪您在网站和其他互联网上的访问，以便为您优化广告投放效果。
        </p>
        <p>
          •
          我们的第三方广告合作伙伴使用Cookie来跟踪您之前访问我们网站和互联网上的其他位置，以便为您提供有针对性的广告。
        </p>
        <p>
          •
          我们还可以在我们的网站上使用网络信标，软件开发工具包和其他自动跟踪方法来与您通信，并衡量绩效和参与度。
        </p>
        <p>
          •
          请注意，由于业界对如何回应“不跟踪”信号没有一致的了解，因此当我们从您的浏览器检测到此类信号时，我们不会改变我们的数据收集和使用惯例。
        </p>
        <p>
          <b>• 停用：</b
          >您可以通过访问“数字广告联盟”的停用页面来停用第三方供应商投放的有针对性的广告。
        </p>

        <p><b> （八）依赖其他合法事由而无需同意的情形 </b></p>
        <p>
          <b>
            以下情形中，我们处理您的个人信息无需征得您的同意：<br />1.
            为订立、履行您作为一方当事人的合同所必需；<br />
            2. 为履行法定职责或者法定义务所必需；<br />
            3.
            为应对突发公共卫生事件，或者紧急情况下为保护自然人的生命健康和财产安全所必需；<br />
            4.
            为公共利益实施新闻报道、舆论监督等行为，在合理的范围内处理个人信息；<br />
            5.
            依照法律规定在合理的范围内处理您自行公开或者其他已经合法公开的个人信息；<br />
            6. 法律、行政法规规定的其他情形。
          </b>
        </p>
        <h5>二、我们如何使用您的个人信息</h5>
        <p>
          1.
          我们仅会根据的上述功能/场景以及相应说明的收集目的对您的个人信息进行使用。
        </p>
        <p>
          <b>
            2.
            我们收集的敏感个人信息已在本隐私政策中通过显著标识进行展示。请您知悉，一旦您的敏感个人信息被泄露、篡改或被非法使用，将会对您的人身或财产安全造成损害。为防止您的敏感个人信息被泄露或被非法使用，我们已采取适当的技术和管理保护措施，尽力保障您的个人信息安全。
          </b>
        </p>
        <p>
          <b>
            3.若您提供的信息中含有他人的个人信息，在向我们提供这些个人信息之前，您需确保您已经取得相关主体的合法、有效同意。如您提供的信息侵犯他人的隐私权、个人信息、商业秘密或其他任何合法权益，给国家、社会公共利益或他人造成损害，您应自行承担全部责任，我们对此不承担任何责任。
          </b>
        </p>
        <p>
          4、请您注意，您在使用时所提供的所有个人信息，除非您删除或通过系统设置拒绝我们收集，否则将在您使用期间持续授权我们使用。
        </p>
        <p>
          5.
          随着我们的产品与/或服务的升级迭代，我们可能会对本隐私政策描述的业务功能及对应收集使用的个人信息类型进行调整。当新功能或服务与我们当前提供的功能或服务相关时，收集与使用的个人信息将与原处理目的具有直接或合理关联。<b
            >当我们要将您的个人信息用于与原处理目的无直接或合理关联的场景，或本隐私政策未载明的其他用途时，或基于特定目的收集而来的信息用于其他目的时，我们会通过更新本隐私政策、相关产品页面等隐私文档并通过弹窗、站内信、推送信息等一种或多种方式向您告知，并事先征求您的同意或具备其他合法事由。</b
          >
        </p>
        <h5>三、我们如何委托处理、对外提供、转移、公开披露您的个人信息</h5>
        <p><b>（一）委托处理</b></p>
        <p>
          为了提升信息处理效率，降低信息处理成本或提高信息处理准确性，我们可能会委托关联公司、基础设施技术、数据处理服务提供商等代表我们来处理用户信息，但我们会通过书面协议、现场审计等方式要求受托公司遵守严格的保密义务及采取有效的保密措施，禁止其将这些信息用于未经用户授权的用途。委托关系解除后，受托方将不再保存您的个人信息。
        </p>
        <p><b> （二）对外提供 </b></p>
        <p>我们目前未对外提供您的个人信息。</p>
        <p>
          未来如我们需要向其他第三方提供您的个人信息的，我们将在相应页面或通过其他适当方式向您告知相关详细情况，并取得您的单独同意或具备其他合法事由。
        </p>
        <p>
          对接收我们向其提供个人信息的第三方主体，我们会与其签署严格的保密协定，要求他们按照我们的说明、本政策以及其他任何相关的保密和安全措施来处理个人信息。
        </p>
        <p>
          <b>（三）转移</b>
        </p>
        <p>
          随着业务的发展，我们可能对业务进行并购重组，您的个人信息可能因此而被转移。我们将要求继受方按照法律及本隐私政策继续保护你的个人信息，继受方变更原先的处理目的、处理方式的，我们将要求继受方重新征得您的同意。
        </p>

        <p><b> （四）公开披露 </b></p>
        <p>
          我们原则上不会公开披露您的个人信息。如确需公开披露您的个人信息，我们会取得您的单独同意或者满足法律规定的其他条件。
        </p>

        <p><b> （五）第三方接入 </b></p>
        <p>
          为保障相关功能的实现和应用的安全稳定运行，我们会接入由第三方提供的软件开发包（SDK）实现该目的。您可以点击此处查看第三方接入的详细信息。
        </p>
        <p>
          阿里云内容审核API <br />
          功能：内容安全检测 <br />
          收集个人信息字段：无 <br />
          提供方式：API提供 <br />
          所属机构：阿里云计算有限公司 <br />
          隐私政策链接：<a
            href="http://terms.aliyun.com/legal-agreement/terms/suit_bu1_ali_cloud/suit_bu1_ali_cloud201902141711_54837.html?spm=a2c4g.11186623.J_9220772140.82.155e4d63fdJIvd"
            target="_blank"
            >http://terms.aliyun.com/legal-agreement/terms/suit_bu1_ali_cloud/suit_bu1_ali_cloud201902141711_54837.html?spm=a2c4g.11186623.J_9220772140.82.155e4d63fdJIvd</a
          >
        </p>
        <p>
          我们会对第三方SDK进行严格的安全检测，并要求合作伙伴采取严格的措施来保护您的个人数据。在满足新的服务需求及业务功能变更时，我们可能会调整我们接入的第三方SDK，并及时在本说明中向您公开说明接入第三方SDK的最新情况。请注意，第三方SDK可能因为版本升级、策略调整等原因导致数据类型存在一些变化，附其官方网站链接或相关隐私保护说明链接供参考，具体请以其公示的官方说明为准。
        </p>

        <h5>四、我们如何存储您的个人信息</h5>
        <p>
          <b>
            一般而言，我们会保留您的个人信息。对于商家，这意味着只要您在平台上维护商店，我们就会保留您的信息。对于合作伙伴，这意味着我们会保留您的信息，直到您通知我们您希望终止与我们的合作伙伴关系为止。对于我们商家的顾客，我们通常仅代表商家处理您的信息，并由商家决定他们将您的信息存储在我们的系统中的时间。
          </b>
        </p>
        <p>
          <b>
            一旦您终止与我们的合作关系，我们将在本隐私政策载明的目的及法律要求的最短保存期限之内，保存您的个人信息。前述期限届满后，我们将对您的个人信息做删除或匿名化处理。
          </b>
        </p>
        <p>
          我们通过跨境运营及控制设施处理和备份个人信息。<b>我们会将您提供的企业名称、姓名、手机号码和邮箱存储在中国大陆，并基于本隐私政策第一节载明的目的，将在中国大陆运营过程中处理的您的信息（个人信息的类型详见于本隐私政策第一节）跨境传输、存储在我们部署于美国的服务器中，同时我们将在中国大陆和香港地区进行远程访问和处理。</b>我们会确保您的个人信息得到与中国大陆同等的保护水平，并在向境外转移您的个人信息前按照关于个人信息出境的法律规定行事。<b
            >您可通过本隐私政策第六部分查阅您行使权利的方式，并通过第九部分查阅我们的联系方式。</b
          >
        </p>

        <h5>五、保障您的个人信息安全</h5>
        <p>
          我们遵循信息安全管理的行业标准，以保护您的个人信息。我们的信息安全系统适用于人员、流程和信息技术系统，基于风险管理基础进行设计。
        </p>
        <p>
          <b
            >没有100%安全的互联网传输与电子数据存储方法，因此，我们无法保证您个人信息的绝对安全，我们会尽力确保您的个人信息和数据的安全。</b
          >
        </p>
        <p>
          <b>
            在不幸发生个人信息安全事件后，我们将按照法律要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以应用程序推送、电子邮件、短信、电话等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报个人信息安全事件的处置情况。
          </b>
        </p>
        <h5>六、管理您的个人信息</h5>
        <p>
          您保有个人信息的所有权利，我们提供合理方式允许您查询、复制、转移、更正、补充、删除个人信息，限制个人信息的使用以及撤回同意。
        </p>
        <p><b> 1、查询、复制、转移权 </b></p>
        <p>
          您有权随时登录并访问您账号，查询、复制您的个人信息，同时您也可以根据本隐私政策载明的联系方式与我们联系查询或复制您的个人信息。在符合相关法律规定且技术可行的前提下，我们将在合理的期限内，通过适当的方式向您提供可复制的个人信息副本。
        </p>
        <p>
          若您需要将您的个人信息转移至其他平台、企业或组织，您可以通过本隐私政策提供的联系方式与我们联系。我们将对您的请求进行审核，在符合网信部门规定的条件且在技术可行的前提下，我们将为您提供转移相应个人信息的途径。
        </p>
        <p><b> 2、更正、补充权 </b></p>
        <p>
          如您发现我们处理的您的个人信息有错误或不完整的，或者在法律法规规定的其他情况下，您可以通过登录平台管理后台并进入“个人中心”后进行更正或补充完善您的个人信息，或通过本隐私政策载明的联系方式与我们联系。
        </p>
        <p><b> 3、删除权 </b></p>
        <p>
          在以下情形中，您可以联系我们提出删除您个人信息的请求，但已做数据匿名化处理或法律法规另有规定的除外：
        </p>
        <p>(a)如果我们处理个人信息的行为违反法律法规；</p>
        <p>(b)基于同意处理您的个人信息，您撤回同意的；</p>
        <p>(c)如果我们处理个人信息的行为违反了与您的约定；</p>
        <p>
          (d)如果我们的处理目的已经实现，无法实现或者为实现处理目的不再必要使用您的个人信息；
        </p>
        <p>(e)如果您不再使用我们的产品与/或服务，或您注销了账户；</p>
        <p>(f)如果我们不再为您提供产品与/或服务，或存储期限已经届满；</p>
        <p>(g)法律法规等规定的其他情形。</p>
        <p>
          在删除相关信息前，我们可能会要求您进行身份验证，以保障账户安全。当我们决定响应您的删除请求时，我们将尽快从产品与/或服务器中删除您的信息。请您知悉，我们可能不会将您需要删除的信息立即从备份系统中删除，但会在备份系统更新时删除。
        </p>
        <p><b> 4、改变您授权的范围 </b></p>
        <p>
          每个业务功能需要一些基本的个人信息才能得以完成，对于额外收集的个人信息的收集和使用，您可以随时给予或撤回您的授权同意您可通过本隐私政策载明的联系方式与我们联系进行授权变更。
        </p>
        <p>
          请您理解，当您撤回您的同意时，我们将无法继续为您提供撤回同意所对应的服务，但不会影响此前基于您的授权而开展的个人信息处理服务。
        </p>
        <p><b> 5、注销账号 </b></p>
        <p>
          如果您希望注销您的账户，您可以通过【系统右上角—账号功能列表—“注销账号”功能】或本隐私政策载明的联系方式与我们联系，我们将及时响应您的请求。
          您知悉并理解，注销您的本平台账号将导致您永久失去对账户和账户中数据的访问权。我们将在验证您的身份并与您协商处理完您账户中的资产后，为您注销账户。在注销账号后，除非根据法律规规定需要留存个人信息的，我们将及时删除您的个人信息或对其作匿名化处理。
        </p>
        <p>
          您注销账号的行为是不可逆的，一旦您的账号被注销，我们不再收集您的个人信息，也将不再为您提供我们的产品和/或服务，因此我们建议您谨慎选择注销账号。
        </p>
        <p><b> 6、约束信息系统自动决策 </b></p>
        <p>
          在本平台某些业务功能中，我们可能依据信息系统、算法等在内的非人工自动决策机制作出决定。如果这些决定显著影响您的合法权益，您有权要求我们作出解释，您可以通过本隐私政策载明的方式联系我们。
        </p>
        <p><b> 7、规则解释说明 </b></p>
        <p>
          如您对本隐私政策存在疑问，您可以通过本隐私政策载明的联系方式与我们联系，我们会对隐私政策相关内容向您进行解释说明。
        </p>
        <p><b> 8、其他权利 </b></p>
        <p>
          在符合相关法律规定的情况下，您的近亲属可以对您身后的相关个人信息行使上述查阅、复制、更正、删除等权利，但您可以联系我们对此做出另外的安排。
        </p>
        <p><b> 9、响应请求 </b></p>
        <p>
          为实现本条所述的用户权利，或您存在任何疑问、投诉、意见或建议的，您可以通过本隐私政策下提供的联系方式与我们联系。<b>
            为确保安全，我们可能会先要求验证您的身份，然后再处理您的请求。我们将在15日或法律规定的期限内答复您的请求。
          </b>
        </p>
        <p>
          对于您一定时期内多次重复的请求，我们将视情况收取一定成本费用；对于需要过多技术手段或存在其他显著困难的请求，我们将为您提供替代方法。
        </p>
        <p><b> 存在以下情形时，我们将拒绝您提出的请求： </b></p>
        <p>
          <b>
            (a)履行法律法规规定的义务相关的；<br />
            (b)与国家安全、国防安全直接相关的；<br />
            (c)与公共安全、公共卫生、重大公共利益直接相关的；<br />
            (d)与刑事侦查、起诉、审判和执行判决等直接相关的；<br />
            (e)有充分证据表明用户存在主观恶意或滥用权利的；<br />
            (f)出于维护用户或其他个人的生命、财产等重大合法权益但又很难得到本人授权同意的；<br />
            (g)响应用户的请求将导致用户或第三方合法权益受到严重损害的；<br />
            (h)涉及商业秘密的。
          </b>
        </p>
        <h5>七、我们如何处理未成年人的个人信息</h5>
        <p>
          <b>
            1.
            平台不面向未成年人提供服务。如您为未成年人，请您不要使用我们的服务或向我们提供您的个人信息。
          </b>
        </p>
        <p>
          <b>
            2.
            对于经父母或法定监护人同意而收集未成年人个人信息的情况，我们只会在法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下处理此信息。
          </b>
        </p>
        <p>
          <b>
            3.
            如果有事实证明我们在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，您可以根据本隐私政策载明的方式联系我们，我们在知晓并核实后会设法尽快删除相关信息。
          </b>
        </p>
        <h5>八、本隐私政策如何更新</h5>
        <p>
          我们的隐私政策可能会适时发生变更。我们会在本页面上发布对本隐私政策所做的任何变更。对于重大变更，我们还会提供更为显著的通知（我们可能会通过在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。
        </p>
        <p>
          本隐私政策所指的重大变更包括但不限于:我们的服务模式发生重大变化；个人信息共享、转让或公开披露的主要对象发生变化；您参与个人信息处理方面的权利及其行使方式发生重大变化；我们的联系方式及投诉渠道发生变化；个人信息安全影响评估报告表明存在高风险时。
        </p>
        <p>我们还会将本隐私政策的旧版本存档，供您查阅。</p>
        <h5>九、联系我们</h5>
        <p>
          如果您对本《隐私政策》或您个人信息的使用有任何疑问、建议或意见，您可以通过以下方式联系我们：<br />
          客服热线：400-176-0388<br />
          个人信息保护负责人邮箱：service@.com
        </p>
      </div>
    </div>
    <!-- 公司信息---end -->

    <!-- 底部---start -->
    <footer>
      <div class="wrapper">
        <div class="href-adress">
          <table>
            <thead>
              <tr>
                <th>关于我们</th>
                <th>服务与支持</th>
                <th>协议</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>
                  <a href="aboutus.html">公司介绍</a>
                </td>
                <td>
                  <a href="helpCenter.html">帮助中心</a>
                </td>
                <td>
                  <a href="userAgreement.html">使用协议</a>
                </td>
              </tr>
              <tr>
                <td>
                  <a href="aboutus.html">联系我们</a>
                </td>
                <td>
                  <a href="javascript:void(0);"></a>
                </td>
                <td>
                  <a href="privacyPolicy.html">隐私政策</a>
                </td>
              </tr>
              <tr>
                <td>
                  <a href="javascript:void(0);"></a>
                </td>
                <td>
                  <a href="javascript:void(0);"></a>
                </td>
                <td>
                  <a href="termService.html">服务条款</a>
                </td>
              </tr>
              <tr>
                <td>
                  <a href="javascript:void(0);"></a>
                </td>
                <td>
                  <a href="javascript:void(0);"></a>
                </td>
                <td>
                  <a href="convention.html">用户自律公约</a>
                  <!-- <a href="javascript:void(0);">服务条款</a> -->
                </td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
    </footer>
    <!-- 底部---end -->

    <!-- 右侧浮窗---start -->
    <div class="right-consult">
      <p class="onlineConsult">在线咨询</p>
      <div class="container-wx">
        <div class="wx">
          <!---  <a href="tencent://message/?uin=308325689&Site=admin5.com&Menu=yes">
            <img src="./images/QQ.png" alt="" />QQ咨询
          </a> --->
          <img style="width:130px" src="./images/wxqrcode-new.jpg" alt="" />
          <p>微信扫一扫</p>
        </div>
      </div>
    </div>

    <div class="floatAlert">
      <div id="top_btn">
        <img src="./images/got.png" alt="" />
      </div>
    </div>
    <!-- 右侧浮窗---end -->

    <!-- 备案 -->
    <div style="color: #999; text-align: center; padding-bottom: 50px">
      Copyright {{ year }}  All Rights Reserved
      <a class="ba-word" href="https://beian.miit.gov.cn/" target="_blank"
        >粤ICP备19032438号-7</a
      >
    </div>
    <!-- 备案 -->

    <!-- start 登录注册等弹窗 -->
    <registerForm
      :showRegister="showRegister"
      @close="showRegister = false"
      @shoSuccess="shoSuccess"
    ></registerForm>
    <registerSuccess
      :showRegSuccess="showRegSuccess"
      :successObject="$store.state.accountInfo"
      @showLogin="$store.state.showsLogin = true"
      @closeSuccAndShowLogin="closeSuccAndShowLogin"
    ></registerSuccess>
    <loginForm
      :showLogin="showLogin"
      :getAccountInfo="getAccountInfo"
      @close="closeLoginAndGetInfo"
      @showRegister="showRegister = true"
      @showChangePassword="showChangePassword = true"
    ></loginForm>
    <changePassword
      :showChangePassword="showChangePassword"
      @close="showChangePassword = false"
    ></changePassword>
    <!-- 重置密码 -->
    <resetPassword></resetPassword>
    <!-- start 创建企业 -->
    <createCompany
      :showCreateCompany="showCreateCompany"
      :accountInfo="$store.state.accountInfo"
      :getAccountInfo="getAccountInfo"
      :showShopAndComList="showShopAndComList"
      @close="showCreateCompany = false"
    ></createCompany>
    <!-- start 创建企业 -->
    <joinCompany
      :showJoinCompany="showJoinCompany"
      @close="closeJoin"
      ref="joinCompany"
    ></joinCompany>
    <!-- 注销账号 -->
    <Deregistration></Deregistration>
    <!-- start 加入店铺 -->
    <joinShop
      :showJoinShop="showJoinShop"
      @close="closeJoinShop"
      ref="joinShop"
    ></joinShop>
    <!-- end 加入店铺 -->
    <!-- start 注册成功后的跳转企业和店铺的弹窗 -->
    <goCompaynAndShop
      :company_list="company_list"
      :shop_list="shop_list"
      :showReg="showReg"
      :showGoCompaynAndShop="showGoCompaynAndShop"
      @close="
        showGoCompaynAndShop = false;
        showReg = false;
      "
      @closeAndShowCreateCom="
        showGoCompaynAndShop = false;
        showCreateCompany = true;
        showReg = false;
      "
      ref="goCompaynAndShop"
    ></goCompaynAndShop>
    <!-- end 注册成功后的跳转企业和店铺的弹窗 -->
    <!-- end 登录注册等弹窗 -->
  </div>
</template>

<script>
import defaultObj from "@/util/defaultObj";
export default {
  ...defaultObj,
};
</script>

<style lang="less">
#app {
  width: 100%;
  height: 100%;
}
</style>
