[
    {
        "word": "A milestone in a baby's life is when they learn how to walk.",
        "tran": "婴儿生命中的一个里程碑是他们学会走路。"
    },
    {
        "word": "Graduation is a huge milestone in a young adult's life.",
        "tran": "毕业是年轻人一生中的一个重要里程碑。"
    },
    {
        "word": "Reaching the next milestone in success would require hours of hard work.",
        "tran": "达到成功的下一个里程碑需要数小时的努力。"
    },
    {
        "word": "The invention of the railroad was a milestone in the history of transportation.",
        "tran": "铁路的发明是交通史上的一个里程碑。"
    },
    {
        "word": "Do you remember what the milestone is to find the old country road?",
        "tran": "你还记得寻找古老乡村道路的里程碑是什么吗？"
    },
    {
        "word": "Arkansas is predominantly an agricultural state.",
        "tran": "阿肯色州主要是一个农业州。"
    },
    {
        "word": "The state as a whole is devoted predominantly to agriculture.",
        "tran": "整个国家主要致力于农业。"
    },
    {
        "word": "During the last four years of his reign Peter's policy was predominantly Oriental.",
        "tran": "在他统治的最后四年里，彼得的政策主要是东方的。"
    },
    {
        "word": "Because vitamin B 12 comes predominantly from animal sources, it is not unusual for vegans and vegetarians to not get enough of this important vitamin in their diets.",
        "tran": "由于维生素 B 12 主要来自动物来源，因此纯素食者和素食者在饮食中缺乏这种重要维生素的情况并不罕见。"
    },
    {
        "word": "The staff is often predominantly volunteers.",
        "tran": "工作人员通常主要是志愿者。"
    },
    {
        "word": "Dean thought later how pivotal that moment was in his marriage.",
        "tran": "迪恩后来想，那一刻对他的婚姻来说是多么关键。"
    },
    {
        "word": "This is why the work of the IAEA is so pivotal.",
        "tran": "这就是为什么国际原子能机构的工作如此重要。"
    },
    {
        "word": "He was pivotal in helping to move the net from a purely academic group in the UK to the commercial environment.",
        "tran": "他在帮助网络从英国的纯粹学术团体转向​​商业环境方面发挥了关键作用。"
    },
    {
        "word": "The Robinson family plays a pivotal role in the popular soap and Dennis is the only current cast member to appear in the first episode and remain on the show (although he did take a 13-year break in the 1990s).",
        "tran": "罗宾逊家族在这部广受欢迎的肥皂剧中扮演着关键角色，而丹尼斯是唯一一位在第一集中出现并继续留在剧中的现任演员（尽管他在 1990 年代确实休息了 13 年）。"
    },
    {
        "word": "The music served as a pivotal piece for the lovers who have fallen in love despite the odds.",
        "tran": "对于尽管困难重重却坠入爱河的恋人来说，这首音乐是关键的一首曲子。"
    },
    {
        "word": "Will this be a pivotal, life-changing year?",
        "tran": "今年会是关键的、改变生活的一年吗？"
    },
    {
        "word": "It was in his relaxed stance, the steadiness of his gaze.",
        "tran": "这是他放松的姿势，他的目光的坚定。"
    },
    {
        "word": "The tension was heavy enough to make Taran lower his stance further.",
        "tran": "紧张的气氛足以让塔兰进一步降低立场。"
    },
    {
        "word": "He said nothing but dropped into a fighting stance.",
        "tran": "他什么也没说，只是摆出了战斗的姿势。"
    },
    {
        "word": "They took a principled stance on Iraq.",
        "tran": "他们在伊拉克问题上采取了原则立场。"
    },
    {
        "word": "Think of how you place your feet when standing on a bus -- that's the kind of stance you're looking for.",
        "tran": "想想当你站在公共汽车上时你的脚如何放置——这就是你正在寻找的姿势。"
    },
    {
        "word": "She was setting a precedent for the future.",
        "tran": "她正在为未来树立先例。"
    },
    {
        "word": "He set the precedent in the history of art.",
        "tran": "他开创了艺术史上的先例。"
    },
    {
        "word": "Preventing violent crimes and crimes against the weak usually take precedent over fraud and economic crimes.",
        "tran": "预防暴力犯罪和针对弱者的犯罪通常优先于预防欺诈和经济犯罪。"
    },
    {
        "word": "Is there a precedent for situations such as this?",
        "tran": "类似的情况有先例吗？"
    },
    {
        "word": "It would be a bad precedent and unworthy of the spirit of the age.",
        "tran": "这将是一个糟糕的先例，不符合时代精神。"
    },
    {
        "word": "The horse had stopped short, and stood firm as a rock.",
        "tran": "马儿突然停了下来，稳如磐石。"
    },
    {
        "word": "He lifted her and placed her on a firm bed.",
        "tran": "他把她抱起来，放在坚固的床上。"
    },
    {
        "word": "I slowly opened one eye with the firm intent to tell him to get lost.",
        "tran": "我慢慢地睁开一只眼睛，坚定地想让他滚开。"
    },
    {
        "word": "I can talk, Alex said, his voice still firm but gentle.",
        "tran": "我会说话，亚历克斯说，他的声音仍然坚定但温柔。"
    },
    {
        "word": "Jonny's voice took on a firm, cold note.",
        "tran": "乔尼的声音变得坚定、冰冷。"
    },
    {
        "word": "His features were firm and chiseled.",
        "tran": "他的五官坚毅而轮廓分明。"
    },
    {
        "word": "He kept his voice firm and cold, unwilling to give on either point.",
        "tran": "他语气坚定而冰冷，不愿在任何一点上做出让步。"
    },
    {
        "word": "She has a large, generous sympathy and absolute fairness of temper.",
        "tran": "她有极大的同情心和绝对公正的脾气。"
    },
    {
        "word": "Though, in all fairness, ten years had changed some people enormously.",
        "tran": "不过，平心而论，十年确实改变了一些人。"
    },
    {
        "word": "In all fairness, this depends on the date.",
        "tran": "平心而论，这取决于日期。"
    },
    {
        "word": "The concept of ' fairness ' is thus somewhat nebulous.",
        "tran": "因此，“公平”的概念有些模糊。"
    },
    {
        "word": "His works are marked by exegetical skill, unusual power of condensation and uniform fairness.",
        "tran": "他的作品具有训诂技巧、非凡的凝聚力和统一的公正性。"
    },
    {
        "word": "He determined immediately to summon another parliament.",
        "tran": "他立即决定召开另一次议会。"
    },
    {
        "word": "Parliament met on the 10th of August.",
        "tran": "议会于 8 月 10 日召开会议。"
    },
    {
        "word": "In this matter the opposition were in the wrong, and by attacking the parliament discredited themselves.",
        "tran": "在这件事上，反对派错了，他们攻击议会，使自己名誉扫地。"
    },
    {
        "word": "In parliament he continued to lend the most effective help to the Liberal party.",
        "tran": "在议会中他继续为自由党提供最有效的帮助。"
    },
    {
        "word": "To him a parliament seemed little better than a mob.",
        "tran": "对他来说，议会似乎比暴民好不了多少。"
    },
    {
        "word": "For years, there has been an argument to legalize marijuana for medical purposes.",
        "tran": "多年来，一直存在着将大麻用于医疗目的合法化的争论。"
    },
    {
        "word": "We should follow the Dutch example and legalize prostitution.",
        "tran": "我们应该效仿荷兰的榜样，使卖淫合法化。"
    },
    {
        "word": "Right to Life - petitions to fight against the campaign to legalize passive euthanasia.",
        "tran": "生命权——反对被动安乐死合法化运动的请愿书。"
    },
    {
        "word": "The main fear was that the Bill would legalize euthanasia by omission.",
        "tran": "主要的担忧是该法案会因疏忽而使安乐死合法化。"
    },
    {
        "word": "I had hail damage to my car as well.",
        "tran": "我的车也遭受冰雹损坏。"
    },
    {
        "word": "She dropped to the sand as a hail of bullets whistled above her head.",
        "tran": "当一阵子弹从她头顶呼啸而过时，她倒在了沙地上。"
    },
    {
        "word": "Thunder rattled the windowpane and hail pounded on the roof.",
        "tran": "雷声震得窗玻璃嘎嘎作响，冰雹砸在屋顶上。"
    },
    {
        "word": "The precipitation of rain, snow and hail is about 55 in.",
        "tran": "雨、雪和冰雹的降水量约为55英寸。"
    },
    {
        "word": "Lord Hailes's younger daughter married Sir 1 \" Hail,\" a call of greeting or salutation, a shout to attract attention, must, of course, be distinguished.",
        "tran": "海尔斯勋爵的小女儿嫁给了爵士 1 “万岁”，一种问候或致敬的称呼，一种吸引注意力的呼喊，当然必须加以区分。"
    },
    {
        "word": "Polish proprietors settled in large numbers on the Cossack territory, and great efforts were made, with the assistance of the Jesuits, to bring the Orthodox population under papal authority.",
        "tran": "波兰地主在哥萨克领土上大量定居，并在耶稣会士的帮助下做出了巨大努力，将东正教人口置于教皇的权威之下。"
    },
    {
        "word": "There are, besides, in Italy some 2500 members of the Greek Orthodox Church.",
        "tran": "此外，在意大利，希腊东正教约有 2500 名成员。"
    },
    {
        "word": "That Athens had the worst of it in this war is certain.",
        "tran": "雅典在这场战争中的表现最糟糕是肯定的。"
    },
    {
        "word": "Mr. Anagnos is in Athens now.",
        "tran": "阿纳诺斯先生现在在雅典。"
    },
    {
        "word": "He died at Athens on the 10th of October 1907.",
        "tran": "1907 年 10 月 10 日他在雅典去世。"
    }
]