[
    {
        "word": "A person could dedicate his life to understanding just one suggestion and never even get close.",
        "tran": "一个人可以一生致力于理解一个建议，却永远无法接近。"
    },
    {
        "word": "With practice, and priority you can dedicate the time to reduce stress.",
        "tran": "通过练习和优先考虑，您可以花时间来减轻压力。"
    },
    {
        "word": "Well, Bordeaux was just the man to help her forget it - if he'd only dedicate his attentions to Darcie.",
        "tran": "好吧，波尔多正是帮助她忘记这一切的人——只要他把注意力集中在达西身上。"
    },
    {
        "word": "You can read them the poem and dedicate it to them.",
        "tran": "你可以给他们读这首诗并将其献给他们。"
    },
    {
        "word": "Dedicate a notebook to time management and take a week to track your time.",
        "tran": "专门用一个笔记本来管理时间，花一周的时间来记录你的时间。"
    },
    {
        "word": "The station will also dedicate an evening to performances by amateur orchestras.",
        "tran": "该电台还将专门安排一个晚上供业余管弦乐队表演。"
    },
    {
        "word": "He launched himself at the man, only to have four guards tackle him.",
        "tran": "他向这名男子发起攻击，结果被四名警卫拦住。"
    },
    {
        "word": "Josh didn't walk away because he was afraid to tackle Alex.",
        "tran": "乔什没有走开，因为他害怕对付亚历克斯。"
    },
    {
        "word": "The whole combination conslitutes a tackle or purchase.",
        "tran": "整个组合构成了一次铲球或购买。"
    },
    {
        "word": "Yes, money was a problem and she hadn't any idea how to tackle the matter.",
        "tran": "是的，钱是个问题，但她不知道如何解决这个问题。"
    },
    {
        "word": "There was very little she wouldn't tackle – including things she shouldn't.",
        "tran": "几乎没有什么是她不能解决的——包括她不应该解决的事情。"
    },
    {
        "word": "As a rule each crew jointly owns its boat and tackle.",
        "tran": "通常，每个船员共同拥有其船只和渔具。"
    },
    {
        "word": "In every house there should be one or more people ready to tackle a firebomb.",
        "tran": "每栋房子里都应该有一个或多个人准备好处理燃烧弹。"
    },
    {
        "word": "Some people argue that individuals can help circumvent this cost by investing in their local farmers markets or community supported agriculture (CSA).",
        "tran": "一些人认为，个人可以通过投资当地农贸市场或社区支持农业（CSA）来帮助规避这一成本。"
    },
    {
        "word": "However, even if eBuddy web messenger makes it possible for you to circumvent the rules, it doesn&#39;t mean you should.",
        "tran": "然而，即使 eBuddy 网络通讯软件使您可以规避规则，但这并不意味着您应该这样做。"
    },
    {
        "word": "They were using an unnatural method to circumvent God's decision - that they would not have a child of their own.",
        "tran": "他们用一种不自然的方法来规避上帝的决定——他们不会有自己的孩子。"
    },
    {
        "word": "Only you can decide if it's right to circumvent their efforts and help counterfeit watchmakers infringe on their copyrights.",
        "tran": "只有您才能决定规避他们的努力并帮助假冒制表商侵犯其版权是否正确。"
    },
    {
        "word": "To circumvent this, you plug a step-down converter into the mains and then your imported console plugs into the converter.",
        "tran": "为了避免这种情况，您可以将降压转换器插入电源，然后将导入的控制台插入转换器。"
    },
    {
        "word": "Why would Yancey have a dummy mail box?",
        "tran": "为什么 Yancey 会有一个虚拟邮箱？"
    },
    {
        "word": "Gabriel began to beat up the dummy again.",
        "tran": "加百列又开始殴打假人。"
    },
    {
        "word": "Gabriel returned to his dummy, beating it with renewed strength.",
        "tran": "加百列回到他的假人身边，用新的力量敲击它。"
    },
    {
        "word": "You guys have been \" sold a dummy \" by your Renault dealers.",
        "tran": "你们已经被雷诺经销商“卖掉了假人”。"
    },
    {
        "word": "Lisa tried to compose her thoughts and expression.",
        "tran": "丽莎试图平复自己的思绪和表情。"
    },
    {
        "word": "She needed time to compose herself before sharing the bad news with him.",
        "tran": "在跟他分享这个坏消息之前，她需要时间冷静下来。"
    },
    {
        "word": "She made an effort to compose herself, taking deep breaths.",
        "tran": "她努力让自己平静下来，深呼吸。"
    },
    {
        "word": "Not till then did he compose this letter.",
        "tran": "直到那时他才写了这封信。"
    },
    {
        "word": "Jessi did her best to compose herself as she returned to the food court.",
        "tran": "杰西尽力让自己平静下来，回到美食广场。"
    },
    {
        "word": "You are flurried--compose yourself!",
        "tran": "你很慌张——冷静一下！"
    },
    {
        "word": "He then went on to compose symphonies performed by a ' guitar orchestra ' of multiple players.",
        "tran": "然后，他继续创作由多名演奏者组成的“吉他管弦乐队”演奏的交响乐。"
    },
    {
        "word": "The conversation turned back to the substitution of the skeleton and the theft of the small bone from their room.",
        "tran": "谈话又回到了骷髅的替换和小骨头从他们房间被盗的问题。"
    },
    {
        "word": "The substitution of electricity for animal traction was begun in Sao Salvador in 1906.",
        "tran": "1906 年，圣萨尔瓦多开始用电力替代动物牵引。"
    },
    {
        "word": "If not, the substitution of an achromatic lens will be of no advantage.",
        "tran": "如果不是，则替代消色差透镜将没有任何优势。"
    },
    {
        "word": "He gave earnest support to the Legal Tender Act, and the substitution of the national for the state banking system.",
        "tran": "他对《法定货币法》以及以国民银行系统取代国家银行系统给予了真诚的支持。"
    },
    {
        "word": "I need your help for the sake of humanity.",
        "tran": "为了人类，我需要你的帮助。"
    },
    {
        "word": "For my sake, come in.",
        "tran": "为了我的缘故，请进来。"
    },
    {
        "word": "The mind is not for the sake of knowledge, but knowledge for the sake of the mind.",
        "tran": "头脑不是为了知识而存在，知识是为了头脑而存在。"
    },
    {
        "word": "She's only four months old, for God's sake!",
        "tran": "天哪，她才四个月大！"
    },
    {
        "word": "He was trying to keep the situation under control – for her sake.",
        "tran": "他试图控制局势——为了她。"
    },
    {
        "word": "Someone broke into her place for god's sake!",
        "tran": "天啊，有人闯入了她的住处！"
    },
    {
        "word": "She should take more interest in it – if only for his sake.",
        "tran": "她应该对此更加感兴趣——哪怕只是为了他。"
    }
]